<?php

return [
    'required'=>'الحقل مطلوب',
    "email"=>'يجب ان يكون الحقل المدخل بريد الكتروني صحيح',
    "digits"=>' يجب ان يتالف الحقل من سلسلة ارقام طولها :digits',
    'min' => [
        'array' => 'يجب ان يتكون الحقل على الاقل من :min عناصر',
        'file' => 'يجب ان يتكون الحقل على الاقل من :min kilobytes',
        'numeric' => 'يجب ان يتكون الحقل على الاقل من :min ارقام',
        'string' => 'يجب ان يتكون الحقل على الاقل من :min احرف',
    ],
    'max' => [
        'array' => 'يجب ان يتكون الحقل على الاكثر من :max عناصر',
        'file' => 'يجب ان يتكون الحقل على الاكثر من :max kilobytes',
        'numeric' => 'يجب ان يتكون الحقل على الاكثر من :max ارقام',
        'string' => 'يجب ان يتكون الحقل على الاكثر من :max احرف',
    ],
    "date"=>"يجب ان يكون الحقل المدخل تاريخ صحيح",
    "numeric"=>"يجب ان يكون الحقل المدخل عبارة عن ارقام"
]


?>
